bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L4S7.svd
        <register>
          <name>LUT29H</name>
          <displayName>LUT29H</displayName>
          <description>Graphic MMU LUT entry 29 high</description>
          <addressOffset>0x10EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT30H</name>
          <displayName>LUT30H</displayName>
          <description>Graphic MMU LUT entry 30 high</description>
          <addressOffset>0x10F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT31H</name>
          <displayName>LUT31H</displayName>
          <description>Graphic MMU LUT entry 31 high</description>
          <addressOffset>0x10FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT32H</name>
          <displayName>LUT32H</displayName>
          <description>Graphic MMU LUT entry 32 high</description>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT33H</name>
          <displayName>LUT33H</displayName>
          <description>Graphic MMU LUT entry 33 high</description>
          <addressOffset>0x110C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT34H</name>
          <displayName>LUT34H</displayName>
          <description>Graphic MMU LUT entry 34 high</description>
          <addressOffset>0x1114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT35H</name>
          <displayName>LUT35H</displayName>
          <description>Graphic MMU LUT entry 35 high</description>
          <addressOffset>0x111C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT36H</name>
          <displayName>LUT36H</displayName>
          <description>Graphic MMU LUT entry 36 high</description>
          <addressOffset>0x1124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT37H</name>
          <displayName>LUT37H</displayName>
          <description>Graphic MMU LUT entry 37 high</description>
          <addressOffset>0x112C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT38H</name>
          <displayName>LUT38H</displayName>
          <description>Graphic MMU LUT entry 38 high</description>
          <addressOffset>0x1134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT39H</name>
          <displayName>LUT39H</displayName>
          <description>Graphic MMU LUT entry 39 high</description>
          <addressOffset>0x113C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT40H</name>
          <displayName>LUT40H</displayName>
          <description>Graphic MMU LUT entry 40 high</description>
          <addressOffset>0x1144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT41H</name>
          <displayName>LUT41H</displayName>
          <description>Graphic MMU LUT entry 41 high</description>
          <addressOffset>0x114C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT42H</name>
          <displayName>LUT42H</displayName>
          <description>Graphic MMU LUT entry 42 high</description>
          <addressOffset>0x1154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT43H</name>
          <displayName>LUT43H</displayName>
          <description>Graphic MMU LUT entry 43 high</description>
          <addressOffset>0x115C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT44H</name>
          <displayName>LUT44H</displayName>
          <description>Graphic MMU LUT entry 44 high</description>
          <addressOffset>0x1164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT45H</name>
          <displayName>LUT45H</displayName>
          <description>Graphic MMU LUT entry 45 high</description>
          <addressOffset>0x116C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT46H</name>
          <displayName>LUT46H</displayName>
          <description>Graphic MMU LUT entry 46 high</description>
          <addressOffset>0x1174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT47H</name>
          <displayName>LUT47H</displayName>
          <description>Graphic MMU LUT entry 47 high</description>
          <addressOffset>0x117C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT48H</name>
          <displayName>LUT48H</displayName>
          <description>Graphic MMU LUT entry 48 high</description>
          <addressOffset>0x1184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT49H</name>
          <displayName>LUT49H</displayName>
          <description>Graphic MMU LUT entry 49 high</description>
          <addressOffset>0x118C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT50H</name>
          <displayName>LUT50H</displayName>
          <description>Graphic MMU LUT entry 50 high</description>
          <addressOffset>0x1194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT51H</name>
          <displayName>LUT51H</displayName>
          <description>Graphic MMU LUT entry 51 high</description>
          <addressOffset>0x119C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT52H</name>
          <displayName>LUT52H</displayName>
          <description>Graphic MMU LUT entry 52 high</description>
          <addressOffset>0x11A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT53H</name>
          <displayName>LUT53H</displayName>
          <description>Graphic MMU LUT entry 53 high</description>
          <addressOffset>0x11AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT54H</name>
          <displayName>LUT54H</displayName>
          <description>Graphic MMU LUT entry 54 high</description>
          <addressOffset>0x11B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT55H</name>
          <displayName>LUT55H</displayName>
          <description>Graphic MMU LUT entry 55 high</description>
          <addressOffset>0x11BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT56H</name>
          <displayName>LUT56H</displayName>
          <description>Graphic MMU LUT entry 56 high</description>
          <addressOffset>0x11C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT57H</name>
          <displayName>LUT57H</displayName>
          <description>Graphic MMU LUT entry 57 high</description>
          <addressOffset>0x11CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT58H</name>
          <displayName>LUT58H</displayName>
          <description>Graphic MMU LUT entry 58 high</description>
          <addressOffset>0x11D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT59H</name>
          <displayName>LUT59H</displayName>
          <description>Graphic MMU LUT entry 59 high</description>
          <addressOffset>0x11DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT60H</name>
          <displayName>LUT60H</displayName>
          <description>Graphic MMU LUT entry 60 high</description>
          <addressOffset>0x11E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT61H</name>
          <displayName>LUT61H</displayName>
          <description>Graphic MMU LUT entry 61 high</description>
          <addressOffset>0x11EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT62H</name>
          <displayName>LUT62H</displayName>
          <description>Graphic MMU LUT entry 62 high</description>
          <addressOffset>0x11F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT63H</name>
          <displayName>LUT63H</displayName>
          <description>Graphic MMU LUT entry 63 high</description>
          <addressOffset>0x11FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT64H</name>
          <displayName>LUT64H</displayName>
          <description>Graphic MMU LUT entry 64 high</description>
          <addressOffset>0x1204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT65H</name>
          <displayName>LUT65H</displayName>
          <description>Graphic MMU LUT entry 65 high</description>
          <addressOffset>0x120C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT66H</name>
          <displayName>LUT66H</displayName>
          <description>Graphic MMU LUT entry 66 high</description>
          <addressOffset>0x1214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT67H</name>
          <displayName>LUT67H</displayName>
          <description>Graphic MMU LUT entry 67 high</description>
          <addressOffset>0x121C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT68H</name>
          <displayName>LUT68H</displayName>
          <description>Graphic MMU LUT entry 68 high</description>
          <addressOffset>0x1224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT69H</name>
          <displayName>LUT69H</displayName>
          <description>Graphic MMU LUT entry 69 high</description>
          <addressOffset>0x122C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
